package com.example.viewmodel

data class District(val name: String, val lat: Double, val lng: Double)

val bangladeshDistricts = listOf(
    District("ঢাকা", 23.8103, 90.4125),
    District("চট্টগ্রাম", 22.3569, 91.7832),
    District("রাজশাহী", 24.3636, 88.6241),
    District("খুলনা", 22.8456, 89.5403),
    District("সিলেট", 24.8949, 91.8687),
    District("বরিশাল", 22.7010, 90.3535),
    District("রংপুর", 25.7439, 89.2752),
    District("ময়মনসিংহ", 24.7471, 90.4203),
    District("গাজীপুর", 23.9999, 90.4203),
    District("নারায়ণগঞ্জ", 23.6238, 90.5000),
    District("কুমিল্লা", 23.4607, 91.1809),
    District("বগুড়া", 24.8481, 89.3730),
    District("কুষ্টিয়া", 23.9013, 89.1204),
    District("যশোর", 23.1664, 89.2081),
    District("দিনাজপুর", 25.6217, 88.6470),
    District("নোয়াখালী", 22.8696, 91.0994),
    District("টাঙ্গাইল", 24.2513, 89.9231),
    District("ফরিদপুর", 23.6071, 89.8429),
    District("পাবনা", 24.0158, 89.2505),
    District("কক্সবাজার", 21.4272, 92.0058)
)

val countries = listOf(
    "বাংলাদেশ",
    "ভারত",
    "পাকিস্তান",
    "সৌদি আরব",
    "সংযুক্ত আরব আমিরাত",
    "মালয়েশিয়া",
    "ইন্দোনেশিয়া",
    "যুক্তরাজ্য",
    "যুক্তরাষ্ট্র"
)
